using System.Collections.Generic;

namespace IndieGame
{
    public class StoryConfig
    {
        public static List<List<string>> Stories =
            new List<List<string>>
            {
                new List<string>
                {
                    "小狐狸没有朋友，一个也没有，因此，它很孤单。 ",
                    "一天，它来到空荡荡的山谷里，生气的大喊：“我想有一个朋友！”",
                    "话音刚落，突然就又有一个声音响起：“我想有一个朋友！”",
                    "啊！这是谁在说话？它和我一样，也想有个朋友呢！那么…… “我们可以做好朋友吗？”小狐狸兴奋又期待的问。 ",
                    "那个声音说：“我们可以做好朋友吗？” 听到这句话，小狐狸高兴的简直就要跳起来啦！ ",
                    "不过，它没有急着跳起来，而是立刻回答：“可以可以！我太愿意啦！” 那个声音也说：“可以可以！我太愿意啦！” ",
                    "咦？小狐狸有些迷糊了，它为什么每一句话都和自己说的一模一样、一字不差呢？ ",
                    "它挠挠头，不明所以。 这时候，一只看了好久的小麻雀飞过来，笑着说：“那是你的回声呀！”",
                    "小狐狸明白了，它非常失落的低下了头。 小麻雀又说：“你很想交朋友是吗？我可以做你的朋友哦！”",
                    "听了这话，小狐狸又抬起了头，它的眼睛里，还闪着亮晶晶的光。"
                },

                new List<string>
                {
                    "冬天快到了，小松鼠嘟啦啦想为它的好朋友和小松鼠吧哒哒织一双漂亮的手套。 ",
                    "小松鼠嘟啦啦问小松鼠吧哒哒说：“吧哒哒你喜欢什么颜色的手套，我来帮你织一双暖和的手套吧！”",
                    "小松鼠吧哒哒高兴的说：“谢谢你，我喜欢蓝色，我想要一双蓝色的手套。”",
                    "小松鼠嘟啦啦特别的高兴，它每天在家里织啊织，希望能快一点织完送给小松鼠吧哒哒，小松鼠嘟啦啦为了织一双蓝色的手套，没办法和小松鼠吧哒哒在一起摘松果了。",
                    "过了一段时间，小松鼠嘟啦啦终于织完一双漂亮的蓝色手套，小松鼠嘟啦啦高兴的拿着漂亮的蓝色手套来找小松鼠吧哒哒。 “咚咚咚！” 小松鼠嘟啦啦敲了敲小松鼠吧哒哒家的门，小松鼠吧哒哒一打开门，就看见小松鼠嘟啦啦站在门口，手里还拿着一双蓝色手套呢！",
                    "小松鼠嘟啦啦呢？看见小松鼠吧哒哒的手里拎着满满一大篮子松果，原来它也正要给小松鼠嘟啦啦送去呢！",
                    "它俩你看看我，我瞧瞧你，都笑了。"
                },

                new List<string>
                {
                    "小麻雀米米的眼睛被一个调皮的小男孩的弹弓打中了，它的一只眼睛永远看不见了。",
                    " “乐乐，我们一起玩儿吧!”小麻雀米米说。",
                    "“我才不和你玩儿呢，独眼龙!”小麻雀乐乐冲它吐了吐舌头，飞走了。",
                    "“亮亮，我们一起玩儿好吗?”小麻雀米米说。",
                    "“你只剩一只眼睛了，怎么和我们玩儿啊!”小麻雀亮亮哈哈大笑着说。",
                    "“菲菲，我们一起玩儿吧!”小麻雀米米又说。",
                    "“你现在真是难看死了，还有点儿吓人，我不跟你玩儿!”小麻雀菲菲拍拍翅膀，也飞走了。",
                    "小麻雀米米难过极了，哇哇大哭起来。",
                    "“别哭，别哭，我陪你玩儿!”小麻雀萌萌飞过来，用翅膀抱了抱它。",
                    "“可是我只有一只眼睛了……”小麻雀米米自卑的说。",
                    "“我可不在乎!”小麻雀萌萌说。",
                    "从那以后，它们每天都在一起玩儿，成了最好的一对朋友。"
                },
                new List<string>
                {
                    "青蛙和小鱼儿是最要好的朋友。每天，青蛙都和小鱼儿在池塘里嬉戏。",
                    "有一天，青蛙对小鱼儿说：“小鱼儿，我要出一趟远门，我会想你的，你放心，我每天都会给你写信。那样，你也就不会孤单了。”",
                    "青蛙的信是写在小树叶儿上的，请邮递员小燕子送给小鱼儿。",
                    "下面就是青蛙写给小鱼儿的信。",
                    "第一封信： 亲爱的小鱼儿，你好!今天我遇到一位好心的蛤蟆，他请我吃了一顿美味的法国大餐，有奶油蛋糕、苹果色拉、番茄酱和柠檬果汁。每一样好东西，我都留了一点，就粘在树叶信上，请你尝一尝。青蛙。 小鱼儿轻轻吻了吻树叶信，她真的闻到了奶油味儿、苹果味儿、番茄味儿和柠檬味儿。",
                    "第二封信： 亲爱的小鱼儿，你好!今天太惊险了，我第一次坐上了云霄飞车。当我转到高高的天上时，我真是害怕极了。如果你在我的身边，我一定不会这么害怕!它比洗衣石可高多了，也比池塘边的柳树高。我吓得闭上了眼睛，结果什么风景也没有看到。青蛙。",
                    "小鱼儿把树叶信放到耳边，她神奇地听到了青蛙的心跳：怦!怦!怦!",
                    "第三封信： 亲爱的小鱼儿，你好!今天太有意思了，我看了一场魔术表演。魔术师就是大名鼎鼎的变色龙。他在舞台上变出了一缸金鱼，两只小鸟，三条小狗，接着从他的手上，飞出了数不清的蝴蝶。最后他打开了一个古旧的盒子，从盒子里变出了一只……，等一等，你猜一猜，他变出了什么?猜不出来吧?真是让人做梦也想不到，他居然从盒子里变出了一只青蛙。",
                    "等一等，你再猜一猜，这只青蛙是谁呢?猜不出来吧?哈，这只青蛙就是我呀!为了感谢我的配合，魔术师变色龙送给我一支水彩笔，现在我把它送给你。",
                    "有了这只水彩笔，你就能在池塘里的石壁上作画了。请翻到树叶信的背面。青蛙。",
                    "树叶信的背面，真的拴着一支水彩笔，小鱼儿高兴得跳起来。",
                    "小鱼儿一共收到了多少封信呢?嗨，我也不知道。我知道的是，青蛙的每一封信，都给小鱼儿带来了惊喜与快乐。",
                    "小鱼儿就把这些树叶信，用细线儿穿起来，做成了一幅长长的窗帘，挂在她家的窗口，可漂亮了。",
                    "最后一封信，青蛙写道： 亲爱的小鱼儿，你好!当你收到这封信的时候，我已经走在回家的路上了。",
                    "我真想快一点见到你呀!相信你也有同样的心情。别忘了抬起头来，往天上望，小燕子邮递员会送给你一个大包裹。青蛙。",
                    "小鱼儿马上抬起头来，正好从天空中掉下来一个绿色的大邮包。 打开邮包，青蛙从里面跳出来： “小鱼儿，你好吗?” 为了快一点赶回来，青蛙把自己当成包裹，",
                    "挂在小燕子的脚爪上，跟树叶信一起，把自己给寄回来了。",
                    "“谢谢你，小燕子!” 青蛙和小鱼儿向天空使劲儿地招手。"
                },
                new List<string>
                {
                    "今天，又到了它的生日，小猪米米躲在一棵大树后面，静静的呆着。",
                    "它发着呆，想啊想啊，想到了以前的生活，多么美好，多么幸福，爸爸把自己扛在肩膀上奔跑着，妈妈在一旁笑靥如花。",
                    "想着想着，它不禁哭了起来。",
                    "突然，大树后面响起了歌声：“祝你生日快乐！祝你生日快乐，祝你生日快乐……” 它惊讶的抬头一瞧，呀！是小猴子、小刺猬和小松鼠，它们正推着一个小推车向小猪米米走来，小推车里，摆着一块大大的、铺满紫的红的果子的大蛋糕！它们说：“米米，今天是你的生日！祝你生日快乐哦！” 小猪米米听了，顿时就哭了，它紧紧的拥抱着自己的好朋友们，不停地说着“谢谢谢谢！”"
                },
                new List<string>()
                {
                    "Ava","Kim","凉鞋"
                }
            };

        public static List<List<string>> StorySummary = new List<List<string>>
        {
            new List<string>
            {
                "原来在空荡荡山谷里说话，就会有回声，那个和小狐狸说话一样的奇怪朋友就是它自己的回声。",
                "小狐狸只是想要一个朋友，怎么都没有呢？",
                "告诉小狐狸的小麻雀耐心告诉小狐狸回声的事情之后，非常乐意交小狐狸这个朋友。",
                "两个小家伙成了非常好的朋友，小狐狸很感动的流下了亮晶晶的眼泪。"
            },
            new List<string>
            {
                "故事中的两只小松鼠真是相亲相爱的一对好朋友，在小松鼠嘟啦啦给小松鼠吧哒哒织手套时，小松鼠吧哒哒也在给自己的好朋友小松鼠嘟啦啦准备松果的礼物。",
                "小朋友们和自己的好朋友都是怎么表达友谊的呢？是和伙伴们一起分享好吃的蛋糕还是为对方送上自己精心准备的礼物呢？"
            },
            new List<string>
            {
                "真正的友谊，不是花言巧语，而是关键时候拉你的那个人。",
                "整日围在你身边，让你有些许小欢喜的朋友，不一定是真正的朋友。",
                "而那些看似远离，实际上时刻关注着你的人，在你快乐的时候，不去奉承你；",
                "你在你需要的时候，默默为你做事的人，才是真正的朋友。"
            },
            new List<string>
            {
                "青蛙和小鱼儿分享了好心的蛤蟆做的法国大餐，信上有食物的味道；",
                "青蛙第一次坐上了云霄飞车，小鱼儿把树叶信放在耳边，感受到了青蛙的心跳；",
                "青蛙看了变色龙的魔术表演，还把自己得到的水彩笔通过信送给了小鱼儿。",
                "青蛙实在是等不及要回家和小鱼儿相聚了，把自己打包成一个大包裹，让小燕子将自己送到了小鱼儿的面前。"
            },
            new List<string>
            {
                "即使没有家人的陪伴，我们也不要对生活失去信心。",
                "还可以去结交很多朋友，朋友带来的快乐和陪伴也是很珍贵的。",
                "小朋友们生日的时候，记得叫来好朋友一起分享好吃的食物和快乐哦。",
                "小猪米米有了朋友们的陪伴，今天的生日非常快乐感动。"
            }
        };
    }
}